Revit 2027 API
Wire.GetMEPSystems Method
 Gets the systems to which the wire belongs.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetMEPSystems()
Public Function GetMEPSystems As IList(Of ElementId)
public:
IList<ElementId^>^ GetMEPSystems()
member GetMEPSystems : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The systems to which the wire belongs.
Remarks
 One wire might belong to more than one circuit.
See Also
Reference
Wire Class
Autodesk.Revit.DB.Electrical Namespace